In [10]:
import pandas as pd

### Series

In [11]:
x=[0,1,2,3,4,5]
a=pd.Series(x)
print(a)
print(type(a))

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
var=pd.Series(x,index=['a','b','c','d','e','f'],dtype='float')
var

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
dtype: float64

In [19]:
# Series from dictionary
dic={"name":["python","C","C++"],"par":[12,13,14,15]}
pd.Series(dic)

name    [python, C, C++]
par     [12, 13, 14, 15]
dtype: object

In [21]:
s1=pd.Series(12,index=[1,2,3,4,5,6,7])
s2=pd.Series(12,index=[1,2,3,4,5])
s1+s2

1    24.0
2    24.0
3    24.0
4    24.0
5    24.0
6     NaN
7     NaN
dtype: float64

### Dataframes

In [27]:
l=[1,2,3,4,5,6]
var=pd.DataFrame(l)
print(type(var))
var

<class 'pandas.core.frame.DataFrame'>

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [34]:
d={"a":[1,2,3,4,5],"s":[1,2,3,4,56],1:[12,3,4,5,5]}
pd.DataFrame(d)

   a   s   1
0  1   1  12
1  2   2   3
2  3   3   4
3  4   4   5
4  5  56   5

In [35]:
pd.DataFrame(d,columns=["a",1])

   a   1
0  1  12
1  2   3
2  3   4
3  4   5
4  5   5

In [43]:
var=pd.DataFrame(d)
# Select a particular element
print(var["a"][3])
print(var[1][0])
var

4
12

   a   s   1
0  1   1  12
1  2   2   3
2  3   3   4
3  4   4   5
4  5  56   5